---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.MetalPerforationsType.Squares
enum: Autodesk.Revit.DB.Visual.MetalPerforationsType
source: html/258542d2-d39e-91ce-1925-d83ce53dc25d.htm
---
# Autodesk.Revit.DB.Visual.MetalPerforationsType.Squares